var dataVer = "令和四年九月十五日更新";

var ningyou = new Array();
ningyou = [
{year:1949,wareki:"昭和10",gedai:["","大楠公桜井","","","","","","","","","","","","","","","","",""]},	//
{year:1950,wareki:"昭和14",gedai:["","横町東部丁内　義経千本櫻","","","","","","","","","","","","","","","","",""]},	//
{year:1951,wareki:"昭和19",gedai:["","横町西部丁内　世界一桃太郎","","","","","","","","","","","","","","","","",""]},	//
{year:1952,wareki:"昭和25",gedai:["","","","","","","","","","","","","(旧東部若者）　辨慶上使","","","","","",""]},	// 1950 S25
{year:1953,wareki:"昭和28",gedai:["","","","","","","中町丁内若者　加藤清正虎退治之場","","","","","","(旧東部若者)　菊寿草摺引","","","","","",""]},	// 1953 S28
{year:1954,wareki:"昭和29",gedai:["","","","","","","","","","","","","","","","","","",""]},	// 1954 S29
{year:1955,wareki:"昭和30",gedai:["","","","","","","","","","","","","","","","","","","高慶商店"]},	// 1955 S30
{year:1956,wareki:"昭和31",gedai:["","","","","","","","","","","","","","","","","","",""]},	// 1956 S31
{year:1957,wareki:"昭和32",gedai:["吉野山の場","","","","","勧進帳","","","","","","","","","","","","",""]},	// 1957 S32
{year:1958,wareki:"昭和33",gedai:["菅原伝授手習鑑　賀の祝","","","小鍛冶","","","里見八犬伝　芳流閣の場","","鞍馬山僧正ヶ谷乃場","","","","(旧東部若者）大阪軍記血判受取之場","牛若丸鞍馬山の場","","","","",""]},	// 1958 S33
{year:1959,wareki:"昭和34",gedai:["","","","","","","","","辨慶衣川奮戦の場","","","","(旧東部若者）　曽我物語","","","","","",""]},
{year:1960,wareki:"昭和35",gedai:["","","","歌舞伎十八番　茨木","","","","岩瀬町丁内　勧進帳","伽羅千代萩床下之場","","","","(旧東部若者）　幡随院長兵衛","","","","","",""]},
{year:1961,wareki:"昭和36",gedai:["","決戦　川中嶋","","","","(寿曽我対面?)","","里見八犬伝","巌流島の決闘","鬼一法眼三略之巻菊畑之場","","","(旧東部若者）　寿曽我對面","","","芦名盛衰記","","",""]},
{year:1962,wareki:"昭和37",gedai:["","","","","","","","","歌舞伎十八番　勧進帳","","","","(旧東部若者）　富士の巻狩り","","","鎧の袖切巴御前奮戦之場","","",""]},
{year:1963,wareki:"昭和38",gedai:["","義経千本桜　大物浦之場","","戻り橋","","天慶乃乱","平家女護島","下新町 下岩瀬町　一乃谷嫩軍記","下新町 下岩瀬町　一乃谷嫩軍記","大化ノ改新　大極殿ノ場","","※<a class='comment' onmouseover='commentAppear(event)' onmouseout='thumbnailDisappear()'>備&nbsp;&nbsp;考</a>※","(旧東部若者）　楼門五三之桐","桑名屋徳蔵入船噺","","須磨元浦合戦記","","",""]},
{year:1964,wareki:"昭和39",gedai:["","","","？有馬染相撲浴衣？","","","","","","","","","祇園祭礼信仰記","","","双蝶々曲輪日記","","",""]},
{year:1965,wareki:"昭和40",gedai:["顔見世季曾我礎","蜘蛛拍子舞","","","","","","","","","","","壇ノ浦の合戦","","","石橋","","",""]},	// S40
{year:1966,wareki:"昭和41",gedai:["壇ノ浦の合戦「義経八艘飛の場」","","","船弁慶","大物浦","","積雪恋乃関扉","歌舞伎十八番の内　鳴神","","","","新歌舞伎十八番の内　紅葉狩","歌舞伎十八番乃内　勧進帳","国性爺合戦　紅流し之場","","根元草摺引","五条乃橋之場","",""]},
{year:1967,wareki:"昭和42",gedai:["白浪五人男皆瀬川の場","近江源氏先陣館　盛綱陣屋","","(娘道成寺？)","歌舞伎十八番　象引","","","","","辨慶上使","","","義経千本桜　川連館の場","","","忍夜恋曲者","大阪夏の陣「千姫救出の場」","","駅前置山"]},
{year:1968,wareki:"昭和43",gedai:["三条小鍛冶宗近稲荷明神","","","","","","","歌舞伎十八番　茨木","","","","","京鹿子娘道成寺","","","暫","鞍馬山牛若丸修練の場","",""]},
{year:1969,wareki:"昭和44",gedai:["桜井の駅の別れ","","","","","","忠臣蔵　松の廊下","新歌舞伎十八番の内　大森彦七","","一谷嫩軍記","","","義経千本桜　大物浦の場","","","義経千本桜","義経記「弁慶最期の場」","",""]},
{year:1970,wareki:"昭和45",gedai:["南総里見八犬伝","","","","新古演劇十種の内　戻橋","生田森陣屋","","伽羅先代萩　床下の場","","伽羅先代萩","","","忍夜恋曲者　相馬館の場","寿曽我対面の場","","勧進帳","南総里見八犬伝","",""]},	// S45
{year:1971,wareki:"昭和46",gedai:["義経千本桜　船弁慶","元禄忠臣蔵","戻り橋","","","土蜘蛛","","","","道成寺　押戻","","","佐倉義民伝","","","石切梶原","義経千本桜「大物浦の場」","",""]},
{year:1972,wareki:"昭和47",gedai:["神明恵和取組　め組の喧嘩","賎ヶ岳の合戦","川中島の合戦","","","歌舞伎十八番　景清","","","","平家女護ヶ島　鬼介島の場","","","凧の為朝","勧進帳","","武勇伝朝比奈城門破り","平家女護ヶ島","","立町置山"]},
{year:1973,wareki:"昭和48",gedai:["小鍛冶","川中島の合戦","義経千本桜　鳥居前の場","","草摺引","大江山","忍夜恋曲者","鞍馬山兵法傳授の場","","夏祭浪花鑑　長町裏の場","","戻り橋","五条の橋","","","積恋雪関扉","源平盛衰記「屋島の合戦の場」","","神明社置山"]},
{year:1974,wareki:"昭和49",gedai:["時今桔梗の旗揚げ","月山富田城の合戦","奥州安達原","","","南総里見八犬伝","","","","勧進帳","","","寿曽我対面","","","小鍛冶","紅葉狩","",""]},
{year:1975,wareki:"昭和50",gedai:["義経記　五条大橋","信州上田城の合戦","菅原伝授手習鑑　筆法伝授の場","菅原伝授手習鑑　車引","平家女護島","歌舞伎十八番　大物浦之場","","蜘蛛の拍子舞","","川中島合戦の場","","","菅原伝授手習鑑　車引の場","巌流島決斗の場","","仮名手本忠臣蔵　兜改めの場","国性爺合戦「虎退治の場」","",""]},	// S50
{year:1976,wareki:"昭和51",gedai:["将門記承平の乱","奥州安達ヶ原","時今也桔梗旗挙　本能寺の場","祇園祭禮信仰記","京鹿子娘道成寺","時今也桔梗旗挙　饗應之場","","「極付」幡随長兵衛","","紅葉狩","","菅原伝授手習鑑　賀の祝","義経千本桜　堀川御所の場","義経千本櫻　川連法眼舘の場","","時今也桔梗旗挙愛宕山の場","歌舞伎十八番の内　暫","","銀座祭り　駅前、駅通り"]},
{year:1977,wareki:"昭和52",gedai:["義経記　衣川の合戦","承平の乱","桶狭間の合戦","小笠原諸礼忠孝","京鹿子娘道成寺","時今也桔梗旗揚　左馬介湖水の渡り","黒塚","源平布引の滝盛綱陣屋","","義経千本桜　大物浦の場","","","一の谷嫩軍記　熊谷陣屋の場","","","寿曽我対面乃場","絵本太功記　尼ヶ崎閑居の場","","神明社置山"]},
{year:1978,wareki:"昭和53",gedai:["仮名手本忠臣蔵","みちのく戦記","伽羅先代萩","奥州安達原の場","菅原伝授手習鑑　道明寺之場","絵本太閤記 十段目","逆櫨松の場","金幣猿島都　観音堂の場","","双面道成寺","","","一条大蔵譚","後三年の役","","鬼一法眼三略巻","信州川中島の合戦　輝虎配膳の場","",""]},
{year:1979,wareki:"昭和54",gedai:["石橋山合戦の場","平治の乱待賢門の戦","鎌倉三代記","鎌倉三代記","歌舞伎十八番　矢乃根","忍夜恋曲者","","歌舞伎十八番の内　景清","羅生門鬼退治の場","南総里見八犬伝芳流閣の場","","","ひらがな盛衰記","","","菅原伝授手習鑑車引の場","奥州安達ヶ原御殿の場","","神明社置山"]},
{year:1980,wareki:"昭和55",gedai:["歌舞伎十八番　勧進帳","後三年の役　金沢柵合戦の場","奥州安達原","川中島之合戦","歌舞伎十八番の内　暫","時今桔梗旗揚","太閤記本能寺の変","","義経一代記の内　鞍馬山修行の場","絵本大功記　十段目尼ヶ崎閑居の場","","","曽我物語　工藤館夜討の場","一の谷嫩軍記　須磨の浦の場","","雪中吉野山合戦の場","前九年の役「衣川の合戦の場」","","思えば遠くへ来たもんだ(山根,菅沢,岩瀬)"]},	// S55
{year:1981,wareki:"昭和56",gedai:["小鍛冶","太平記　打出浜の合戦","英勇武者鑑","桜井の駅の別れ","","決闘高田乃馬場","岸柳島の決闘","","茨木","菅原伝授手習鑑賀の祝","","","源平物語　義仲旗揚げの場","保元軍記","","太閤記　賤ヶ岳の合戦","桶狭間の合戦","",""]},
{year:1982,wareki:"昭和57",gedai:["大阪夏の陣　真田丸幸村奮戦","姉川の合戦の場","平治の乱　紫震殿の戦い","矢の根","義経八艘跳之場","土蜘蛛","清正誠忠録「伏見城内の場」","勧進帳","決闘鍵屋の辻","義経記　衣川の戦い","","太平記　湊川の合戦","賤ヶ嶽の合戦","桜井の駅の別れ","","児雷也","源平盛衰記　壇ノ浦の合戦","",""]},
{year:1983,wareki:"昭和58",gedai:["椿説弓張月　大島奮戦の場","源平盛衰記　篠原の合戦","武勇の誉虎退治","伽羅先代萩","菅原伝授手習鑑　車引之場","葛城山拍子舞","神霊矢口の渡しの場","川中島の合戦","京鹿子娘道成寺","大阪夏の陣　安居天神の場","","奥州安達ヶ原　御殿の場","奥州下りの場","戦国絵巻合戦三方ヶ原の場","","八股大蛇退治","時今也桔梗旗揚　本能寺の変","","置山"]},
{year:1984,wareki:"昭和59",gedai:["中先代の乱鎌倉攻めの場","源平盛衰記　宇治川の合戦の場","合戦桶狭間","妹背山婦女庭訓","青葉の笛一の谷の合戦之場","絵本太功記","義経記　衣川の合戦","一谷嫩軍記　須磨の浦の場","義経千本桜大物浦乃場","長良川中渡し合戦の場","","義経千本桜　大物浦の場","菅原伝授手習鑑　車引の場","天慶の乱　下総猿島の合戦","","源頼光館妖怪の場","平治の乱　紫雲殿前対決の場","","立町大置山、保育園"]},
{year:1985,wareki:"昭和60",gedai:["後三年の役　金沢柵の戦い","合戦　三方ヶ原","国府台の合戦","南総里見八犬伝","姉川の戦之場","大阪夏の陣","小鍛冶","太閤記　山崎の戦い　小栗栖野の場","暫","小手指ヶ原の合戦","","菅原伝授手習鑑　車引の場","大阪冬の陣","曽我物語　祐経陣屋見参の場","","大坂夏の陣　道明寺戦の場","南北朝時代　吉野山合戦の場","","保育園"]},	// S60
{year:1986,wareki:"昭和61",gedai:["政宗飛翔人取橋の戦い","源平盛衰記　倶利伽羅峠合戦の場","仮名手本忠臣蔵","歌舞伎十八番の内　景清","車引の場","会津磐梯山麓の合戦","曽我物語　「頼朝館庭先の場」","建武の中興　千早城の戦","国性爺合戦　千里ヶ竹の場","歌舞伎十八番　景清","鎌倉三代記","娘道成寺押戻しの場","大坂夏の陣　重成出陣の場","義経記　五条大橋","","源氏旗揚　黄瀬川の陣","源平屋島の合戦　教経奮戦の場","",""]},
{year:1987,wareki:"昭和62",gedai:["建武の中興鎌倉攻め","石橋山合戦","宇治川先陣の争い","土蜘蛛","歌舞伎十八番　暫","深沢城の戦　矢文之場","伊達政宗　小田原参陣の場","桶狭間の合戦","時今也桔梗旗挙　本能寺の場","船弁慶","伽羅先代萩","川中島の合戦","一の谷合戦　鵯越の場","義経千本桜　堀河屋形の場","","奇襲桶狭間","一の谷嫩軍記　須磨の浦の場","",""]},
{year:1988,wareki:"昭和63",gedai:["甲陽軍鑑川中島の合戦","賤ケ嶽合戦の場","壇の浦の合戦　義経八艘飛の場","小鍛冶","後三年の役乃場","真田三代記","太閤記　矢作橋","義経千本桜　堀川館夜討の場","歌舞伎十八番　七つ面","歌舞伎十八番の壱　「暫」","三方ヶ原の合戦　祝田坂の場","歌舞伎十八番の内　鳴神","義経千本桜　吉野山の合戦","合戦　桶狭間の場","","歌舞伎十八番　押戻し","祇園祭礼信仰記　金閣寺","","置山、駅"]},
{year:1989,wareki:"平成元",gedai:["大物浦の場","小谷城の戦","茨木・綱館","歌舞伎十八番　象引","歌舞伎十八番　暫","義経千本桜　大物浦乃場","「春日の局」より本能寺の変","伽羅先代萩　床下の場","義経千本桜　鳥居前の場","楼門五三桐","義経千本桜　大物浦の場","土蜘蛛","奥州安達原　環の宮明御殿の場","義経紀　衣川の合戦","","壇ノ浦の合戦","近江源氏先陣館　盛綱陣屋","",""]},
{year:1990,wareki:"平成2",gedai:["太平記桜井の駅の別れ","真田軍記　松枝城合戦の場","太閤記石山合戦の場","国性爺合戦","菅原伝授手習鑑　車引之場","武勇伝虎退治","南総里見八犬伝　芳流閣の場","歌舞伎十八番の内　勧進帳","男伊達吉例曽我","一谷嫩軍記　熊谷陣屋の場","信長公記　長篠の合戦","時今也桔梗旗揚之場","四条畷の合戦","合戦川中島","","歌舞伎十八番　景清","妹背山婦女庭訓　奥庭入鹿誅伐の場","",""]},
{year:1991,wareki:"平成3",gedai:["太平記鎌倉攻め","源平盛衰記　平治の乱","川中島の合戦","新古演劇十種の内　戻り橋","赤穂浪士吉良邸討入之場","決闘巌流島","元禄忠臣蔵　お浜御殿の場","太閤記　本能寺の変","歌舞伎十八番　鎌髭","大江山酒呑童子退治の場","歌舞伎十八番の内　不動","桶狭間の合戦","大三島の合戦","○○○　越前北の庄","","紅葉狩","<span style='font-size:smaller;'>尼子十勇士武勇伝　山中鹿之助富田城合戦一騎打ちの場</span>","","送りっこ"]},
{year:1992,wareki:"平成4",gedai:["信長記姉川の合戦","陰徳太平記　厳島の合戦","大坂夏の陣","菅原伝授手習鑑　車引","歌舞伎十八番　暫","義経記　五条大橋","鎌倉三代記","藤原三代　衣川の合戦","御攝勧進帳","積恋雪関扉","義経千本桜　奥庭の場","御攝勧進帳","歌舞伎十八番　矢の根","大坂夏の陣　幸村・家康本陣襲撃の場","","源平布引瀧","寿曽我対面","",""]},
{year:1993,wareki:"平成5",gedai:["前九年の役衣川の戦","椿説弓張月","源平盛衰記　倶利伽羅峠の合戦","夜討曽我狩場曙","後三年の役の場","甲陽軍鑑「川中島の戦い」","絵本太功記　尼ヶ崎閑居の場","奥州安達ヶ原　環宮明御殿の場","一ノ谷嫩軍記　須磨浦の場","関ヶ原の合戦　島津敵中突破の場","歌舞伎十八番の内　助六","妹背山婦女庭訓　御殿の場","鶴姫奇伝　大三島合戦","太閤記　関東小田原攻め","","近江源氏先陣館　盛綱陣屋","伊達風雲録　人取橋の戦い","",""]},
{year:1994,wareki:"平成6",gedai:["大阪夏の陣","川越の夜討ち","義経千本桜　大物浦の場","歌舞伎十八番の内　関羽","義経千本桜　大物浦の場","歌舞伎十八番の内　勧進帳","伊達軍記　摺上ヶ原の戦い","義経記　五条大橋","船弁慶","歌舞伎十八番　暫","天慶の乱　日振島出陣の場","錣引","長篠の合戦","前九年の役　黄海の戦い","","新歌舞伎十八番　船弁慶","大津絵道成寺","","置山"]},
{year:1995,wareki:"平成7",gedai:["岸柳島の決闘","雲陽軍記　月山富田城一騎打ちの場","長篠の合戦","児雷也豪傑譚話","菅原伝授手習鑑車引之場","小田原合戦","太閤記　山崎の戦い　小栗栖野の場","後三年の役「金沢柵の戦い」","新古演劇十種の内　土蜘","衣川の合戦","歌舞伎十八　嫐","菅原伝授手習鑑　天拝山","千早城の合戦","衣川の合戦　高館の戦い","天正茶釜合戦","川中島の合戦","南北朝時代　美濃青野原合戦の場","","置山"]},
{year:1996,wareki:"平成8",gedai:["南総里見八犬伝芳流閣の場","「太平記」　多々良浜の合戦","源平盛衰記　屋島の合戦","黒塚","歌舞伎十八番　矢の根","歌舞伎十八番　矢の根","義経千本桜　すしやの段","一谷嫩軍記　須磨の浦の場","歌舞伎十八番の内　毛抜","田楽狭間の合戦","義経千本桜鳥居前","ひらがな盛衰記　逆艪","菅原伝授手習鑑　車引之場","関ヶ原の合戦　松尾山の場","幕末風雲録　池田屋騒動","義経記　五条の大橋","源平魁つつじ　扇谷熊谷","",""]},
{year:1997,wareki:"平成9",gedai:["近江源氏先陣館「盛綱陣屋の場」","源平盛衰記　壇ノ浦の戦い","悪源太襲雷布引瀧","金幣猿島郡","一の谷の合戦","源平合戦　一の谷の戦い","一谷嫩軍記　熊谷陣屋","天慶の乱　北山の決戦","五条橋","歌舞伎十八番　矢の根","歌舞伎十八番　勧進帳","伽羅先代萩　床下","義経千本桜　川連法眼館の場","二天武勇伝　岸柳島の決闘","武田盛衰記　天目山の場","兵根元曽我","義経千本桜花矢倉の場","椿説弓張月","『角館のお祭り』公演　桜美町若者「暫」"]},
{year:1998,wareki:"平成10",gedai:["義経千本桜「鳥居前」","大江山鬼伝説","歌舞伎十八番　鳴神","菅原伝授手習鑑　天拝山","衣川の合戦","連獅子","仮名手本忠臣蔵五段目　山崎街道の場","義経千本桜　大物浦","歌舞伎十八番　象引","茨木","北越軍記春日山城出陣の場","義経千本桜　河連法眼館奥庭の場","寿曽我対面の場","本能寺の変","ご存知黒田武士","義経千本桜　河連法眼館奥庭","甲陽軍鑑　-川中島の戦い-　海津城出陣の場","船弁慶",""]},
{year:1999,wareki:"平成11",gedai:["厳島の合戦","伊達風雲録　会津福島攻め","一の谷嫩軍記　熊谷陣屋","義経千本桜　大物浦","歌舞伎十八番　暫","越後の勇景虎登場","伽羅先代萩　刃傷の場","天竺徳兵衛韓噺","絵本太功記　尼ヶ崎庵室乃場","義経千本桜　大物浦","歌舞伎十八番　解脱","歌舞伎十八番　景清","鞍馬山六韜三略の場","武田軍鑑三方ヶ原の戦い","助六由縁江戸櫻","天竺徳兵衛韓噺","春日龍神","青砥稿花紅彩画　極楽寺山門",""]},
{year:2000,wareki:"平成12",gedai:["道三入道「長良川河畔の決戦」","勧進帳","国性爺合戦","桶狭間の合戦","歌舞伎十八番　押戻","一谷嫩軍記　熊谷陣屋","巴御前","上田原の戦い","新歌舞伎十八番の内　紅葉狩","児雷也豪傑譚話　新潟山中の場","歌舞伎十八番　暫","歌舞伎十八番　象引","菊寿の草摺引","壇ノ浦の戦い　義経八艘飛び","旗は六連銭　沼田城親娘の決別","戸沢九郎盛安　阿気野の戦い","土蜘蛛","奥州安達ヶ原　環宮明御殿の場",""]},
{year:2001,wareki:"平成13",gedai:["「戦国統一」石山本願寺焼討","合戦　小豆坂","大津絵道成寺","京鹿子娘道成寺","本能寺の変","三国志　呂豪の計","国性爺合戦「紅流の場」","蒙古襲来","菅原伝授手習鑑　賀乃祝","義経記「五条の大橋」","祇園祭礼信仰記","時今也桔梗旗揚","助六由縁江戸櫻","歌舞伎十八番「暫」","将門記　猿島北山の合戦","大江山酒呑童子退治","菅原伝授手習鑑　「車引」","信長記　本能寺の変",""]},
{year:2002,wareki:"平成14",gedai:["応仁の乱","忠臣蔵","五条橋","忍夜恋曲者","越後小千谷の里","石川五右衛門","黒塚","妹背山婦女庭訓　三笠山御殿","義経千本桜","歌舞伎十八番　勧進帳","戦国合戦絵巻　川中島八幡原の一騎討ち","鯉つかみ","蜘蛛の拍子舞","一谷嫩軍記　須磨浦","大阪夏の陣　道明寺の戦い","夢追い関ヶ原","景清","大阪夏の陣　幸村奮戦の場",""]},
{year:2003,wareki:"平成15",gedai:["小鍛冶","地震加藤","助六","御摂勧進帳","巌流島の決闘","賤ヶ岳合戦　七本槍","琵琶湖畔　粟田口の戦い","決闘鍵屋の辻","義経千本桜　大物浦の場","大江山酒天童子退治の場","歌舞伎十八番　「鎌髭」","菅原伝授手習鑑　賀の祝","草薙剣の由来","河越城の合戦","義経千本桜　「渡海屋」","歌舞伎十八番の内　象引","新古演劇十種の内　「茨木」","水攻め備中高松城　中国大返し",""]},
{year:2004,wareki:"平成16",gedai:["義経千本桜　「大物浦の場」","楼門五三桐","錣引","大江山鬼退治","義経千本桜　「大物浦」","源氏旗揚げ義経奮戦","紅葉狩り","夜討曽我","歌舞伎十八番の内　「暫」","歌舞伎十八番　「解脱」","船弁慶","奥州安達原　環の宮明御殿の場","菅原伝授手習鑑　「車引の場」","末森城の戦","源平屋島の合戦","天下統一小田原攻め「石垣山一夜城」","絵本太功記「尼ヶ崎閑居の場」","天下布武　桶狭間出陣　幸若舞「敦盛」","置山"]},
{year:2005,wareki:"平成17",gedai:["奇襲桶狭間","みちのく戦記","南総里見八犬伝圓塚山","歌舞伎十八番の内「暫」","奥州安達ヶ原環宮明御殿の場","鳴神","関ヶ原の戦い「敵中突破」","大江山酒呑童子","歌舞伎十八番の内「鎌髭」","布引瀧悪源太霊討","伽羅先代萩","義経千本桜「吉野山」","吉例曽我の対面","歌舞伎十八番「矢の根」","二天武勇伝伊賀の決闘","「義経記」運命の出会い","義経千本桜「堀川御所塀外の場」","桔梗討伐山崎天王山の場","置山、他"]},
{year:2006,wareki:"平成18",gedai:["上洛三方ヶ原","義経記　衣川の戦い","日本振袖始","川中島　一騎討ち","児雷也豪傑譚話","忠義の鏡六文銭","戻り橋","極付播随院長兵衛　水野邸湯殿の場","船弁慶","関ヶ原の合戦　松尾山の決断","炎上　大和信貴山城の場","忠臣蔵　松の廊下刃傷の場","忍夜恋曲者","上田城　神川の戦い","多々良浜の戦い","「源平盛衰記」　摂州大物浦","隅田川続俤　～法界坊～","歌舞伎十八番「暫」鎌倉権五郎景政","置山、他"]},
{year:2007,wareki:"平成19",gedai:["夜襲　小谷城","建武の中興　湊川の戦い","小笠原諸礼忠孝","茨木　綱館","歌舞伎十八番の内「暫」","寿　曽我対面","歌舞伎十八番　「影清」破牢の場","義経千本桜　堀川館夜討の場","歌舞伎十八番の内　七つ面","助六廓の花見時","橋弁慶","義経千本桜　大物浦","金幣猿島郡","「太平記」鎌倉攻め","蔚山城の戦い","「甲軍策略」三方ヶ原","歌舞伎十八番「鳴神」","押戻","置山、他"]},
{year:2008,wareki:"平成20",gedai:["軍神　手取川の戦い","真田三代記　上田城攻防","奥州征伐　衣川の合戦","奥州安達原　環宮明御殿の場","摺上原の戦い","山崎の合戦","鵺退治","決闘　高田馬場","島原の乱","武勇伝　怪童丸　鯉つかみ","紅葉狩","義経千本桜　大内の場","時今也　桔梗旗揚","国性爺合戦","連獅子","雷神不動北山桜","小牧長久手の戦い","楼門五三桐","置山、他"]},
{year:2009,wareki:"平成21",gedai:["鬼伝説　雷斬り","源平盛衰記　屋島の戦いより「錣引」","常陸国　鬼　義重","助六由縁江戸桜","歌舞伎十八番　象引","助六由縁江戸桜","奥州安達原　環宮明御殿","助六由縁江戸桜","桶狭間の合戦","慶長出羽合戦上杉軍出陣","国盗り物語「正徳時対面の儀」","鐘入解脱衣","妹背山婦庭訓　三笠山御殿の場","中国大返し　天王山の戦い","源平盛衰記「宇治川の先陣争い」","激闘　道明寺","義経千本桜「大物浦の場」","歌舞伎十八番　勧進帳","置山、他"]},
{year:2010,wareki:"平成22",gedai:["戦国仕掛人　疾き雲の如く","合戦　石山橋","鳴神","義経千本桜　大物浦","川中島の戦い","天下布武の足掛かり　長篠戦","春日龍神","時今也桔梗旗揚　饗応の場","土蜘蛛","鵺退治","南総里見八犬伝　芳流閣の場","鞍馬山　修練の場","源平盛衰記　鵯越","唐沢山城　中央突破の場","天正伊賀の乱","寿　式三番叟","「根元草摺引」","源平合戦　奇襲一の谷","置山、他"]},
{year:2011,wareki:"平成23",gedai:["鬼小島一騎打ち　川中島","「小鍛冶」","歌舞伎十八番　関羽","歌舞伎十八番　矢の根","京鹿子娘道成寺","川中島の戦い","大津絵道成寺","一谷嫩軍記　熊谷陣屋","伽羅先代萩","歌舞伎十八番　暫","建武の中興　櫻井の別れ","歌舞伎十八番　暫","菅原伝授手習鑑　車引の場","設楽ケ原の合戦","一谷嫩軍記「熊谷陣屋」","近江蓑作城攻落　「信長上洛」","ひらかな盛衰記　逆櫓","大阪夏の陣　誉田の戦い","置山、他"]},
{year:2012,wareki:"平成24",gedai:["車引","太十　尼ヶ崎閑居の段","信長公記　本能寺","新古演劇十種の内　戻り橋","夜討曽我狩場曙","歌舞伎十八番の内　景清","歌舞伎十八番　矢の根","義経千本桜　大物浦　碇知盛","歌舞伎十八番の内　景清","楼門五三桐","菅原伝授手習鑑　天拝山の段","歌舞伎十八番　毛抜","助六由縁江戸桜","三草山の戦い","杭瀬川の戦い","日本振袖始","碁盤忠信","義経千本桜　鳥居前の場","置山、他"]},
{year:2013,wareki:"平成25",gedai:["名家島津「肥前の熊討ち」","甲陽軍鑑川中島　八幡原出陣の場","塵輪鬼","蜘蛛の拍子舞","神明恵和合取組　め組の喧嘩","車引き","湊川の戦い","大阪夏の陣","義経千本桜　大物浦乃場","大阪冬の陣　真田丸の戦い","歌舞伎十八番　外郎売","歌舞伎十八番　押戻","歌舞伎十八番　勧進帳","衣川の合戦","歌舞伎十八番　勧進帳","五十三驛　岡崎化け猫退治","蜘蛛の拍子舞","三方ヶ原の戦い","置山、他"]},
{year:2014,wareki:"平成26",gedai:["天下布武　土岐の慕情　本能寺","天正四国の役　三坂峠の一騎打ち","鎌倉三代記","伽羅先代萩","菅原伝授手習鑑　車引き","大阪夏の陣　道明寺の戦い","鎌髭","三湖伝説　十和田の決闘","義経千本櫻　鳥居前","水滸伝　張順水門破り","総見記桶狭間の合戦　熱田の宮　出陣の場","船弁慶","積恋雪関扉","大阪冬の陣　真田丸攻防戦","後三年の役　金沢の柵","夜襲　手取川","船弁慶","歌舞伎十八番「象引き」","置山、他"]},
{year:2015,wareki:"平成27",gedai:["独眼竜　関白謁見","吾妻鏡　青葉の笛より　須磨の浦の戦","伽羅先代萩","一ノ谷合戦　鵯越の逆落し","菅原伝授手習鑑　道明寺","歌舞伎十八番の内　暫","青砥縞花紅彩画　稲瀬川勢揃いの場","伽羅先代萩","歌舞伎十八番の内　助六","義経記　衣川の合戦","七つ面","天一坊大岡政談","「矢の根」","川中島の合戦","大江山鬼伝説","源氏旗揚げ　黄瀬川の陣","五条橋","源平屋島の戦い　那須与一","置山、他"]},
{year:2016,wareki:"平成28",gedai:["戦立の華　岩屋の拒城","奥州安達ヶ原三段目の切　環宮明御殿の段","蔵王堂花矢倉","葵上","清正猛虎仇討ち","徳川三傑　井伊の赤備","鬼一法眼三略巻","－","賤ヶ岳合戦","蜘蛛絲梓弦","－","道明寺の戦い","一谷嫩軍記　熊谷陣屋","壇ノ浦の戦い　義経八艘飛び","一言坂の戦い","九州関ケ原　石垣原合戦","紅葉狩","虎退治","置山、他"]},
{year:2017,wareki:"平成29",gedai:["神明恵和合取組　め組の喧嘩","大坂夏の陣","忠義臣　辨慶立往生","小鍛冶","桶狭間の戦い","連獅子","江戸崎城の攻防","歌舞伎十八番　勧進帳","義経千本桜　大物浦","羅生門","－","御攝勧進帳","義経千本桜　大物浦","姉川の合戦","義経記　五条大橋","岩戸神楽ノ起顕","京鹿子娘道成寺","歌舞伎十八番　外郎売","置山、他"]},
{year:2018,wareki:"平成30",gedai:["俵藤太伝　夢幻将門　坂東平定","源平盛衰記　篠原の合戦の場","歌舞伎十八番　蛇柳","歌舞伎十八番の内　勧進帳","歌舞伎十八番　不動","絵本太功記　十段目","義経千本櫻　鳥居前", "山陰の麒麟児一騎打ち　築山富田城の戦い","羅生門","碇知盛","－","祇園祭礼信仰記　金閣寺","寿　曽我対面","桶狭間の戦い","歌舞伎十八番　矢の根","法界坊","錣引","川中島の戦い","置山、他"]},
{year:2019,wareki:"令和元",gedai:["楠木流　千早の檄城","源平盛衰記　壇ノ浦の合戦","武勇の誉　猛虎一騎討","平治の乱　六波羅合戦","義経記　五条大橋","桔梗旗揚","小鍛冶", "大津絵道成寺","歌舞伎十八番　矢の根","大江山鬼退治","歌舞伎十八番　暫","昇龍哀別瀬戸内","国姓爺合戦　獅子ヶ城の場","邂逅　賤ケ岳の戦い","長篠設楽原の合戦","勇将・豪傑　姉川一騎打ち","大江山酒呑童子","菅原伝授手習鑑　車引之場","置山、他"]},	// 2019 R1
{year:2020,wareki:"令和２",gedai:["<span style='font-size:smaller;'>爆炎と梟雄 逆臣討伐戦</span>　大和国信貴山城","－","本朝廿四孝","紅葉狩","－","－","－", "－","歌舞伎十八番　不破","－","－","－","－","－","一谷嫩軍紀　須磨の裏","－","壇ノ浦　義経八艘飛び","－","その他"]},	// 2020 R2
{year:2021,wareki:"令和３",gedai:["不破関ケ原、<br>京 市原野の場","源平盛衰記　平治の乱","戻橋","妹背山婦女庭訓","桃太郎 鬼退治","－","－","為朝の武威　保元物語", "歌舞伎十八番　押戻","－","－","歌舞伎十八番　象引","－","－","歌舞伎十八番　鎌髭","－","後三年の役　金沢の柵","大江山の鬼退治","置山、他"]},	// 2021 R3
{year:2022,wareki:"令和４",gedai:["黒塚","六条本圀寺合戦","時今也桔梗旗揚　愛宕山の場","押戻","歌舞伎十八番　暫","歌舞伎十八番の内　不破","桜井の別れ","寿曽我対面", "勢獅子音羽花籠お祭り","児雷也豪傑譚話","蜘蛛の絲宿直噺","一谷嫩軍記　菟原の里林住家の段","義経千本桜　川連法眼館の場","小谷城虎口攻め","船弁慶","羅生門の鬼退治","長篠の合戦","巌流島","置山、他"]}	// 2022 R4
];

var chounai = new Array();
chounai = ["山根谷地町旭会若者", "横町若者", "桜美町若者", "上新町若者", "七日町丁内", "西勝楽町若者", "中央通り", "本町通り", "下岩瀬町若者", "菅沢丁内若者", "東部若者", "駅通り若者", "駅前若者", "岩瀬若者一同", "大塚若者", "西部若者", "北部丁内若者", "川原町若者", "置山、他"];
